## Clusters Terraform Plan
  ```terraform
  
#########################################################
##
##   Planning changes for sandboxy environment...
##
#########################################################

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

Terraform will perform the following actions:

  # module.kubevirt_operator[0].kubectl_manifest.cdi_operator["/apis/apiextensions.k8s.io/v1/customresourcedefinitions/cdis.cdi.kubevirt.io"] will be updated in-place
  ~ resource "kubectl_manifest" "cdi_operator" {
        id                      = "/apis/apiextensions.k8s.io/v1/customresourcedefinitions/cdis.cdi.kubevirt.io"
        name                    = "cdis.cdi.kubevirt.io"
      ~ yaml_incluster          = (sensitive value)
        # (14 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

#########################################################
##
##   Planning changes for tools environment...
##
#########################################################

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

#########################################################
##
##   Planning changes for cluster-api environment...
##
#########################################################

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.proxmox_talos_clusters[0].kubernetes_manifest.cluster_api_manifests["Cluster-testing-cluster-clusters"] will be created
  + resource "kubernetes_manifest" "cluster_api_manifests" {
      + manifest = {
          + apiVersion = "cluster.x-k8s.io/v1beta1"
          + kind       = "Cluster"
          + metadata   = {
              + name      = "testing-cluster"
              + namespace = "clusters"
            }
          + spec       = {
              + controlPlaneRef   = {
                  + apiVersion = "controlplane.cluster.x-k8s.io/v1alpha3"
                  + kind       = "TalosControlPlane"
                  + name       = "testing-cluster-talos-cp"
                }
              + infrastructureRef = {
                  + apiVersion = "infrastructure.cluster.x-k8s.io/v1alpha1"
                  + kind       = "ProxmoxCluster"
                  + name       = "testing-cluster-proxmox-cluster"
                }
            }
        }
      + object   = {
          + apiVersion = "cluster.x-k8s.io/v1beta1"
          + kind       = "Cluster"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "testing-cluster"
              + namespace                  = "clusters"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + availabilityGates    = (known after apply)
              + clusterNetwork       = {
                  + apiServerPort = (known after apply)
                  + pods          = {
                      + cidrBlocks = (known after apply)
                    }
                  + serviceDomain = (known after apply)
                  + services      = {
                      + cidrBlocks = (known after apply)
                    }
                }
              + controlPlaneEndpoint = {
                  + host = (known after apply)
                  + port = (known after apply)
                }
              + controlPlaneRef      = {
                  + apiVersion      = "controlplane.cluster.x-k8s.io/v1alpha3"
                  + fieldPath       = (known after apply)
                  + kind            = "TalosControlPlane"
                  + name            = "testing-cluster-talos-cp"
                  + namespace       = (known after apply)
                  + resourceVersion = (known after apply)
                  + uid             = (known after apply)
                }
              + infrastructureRef    = {
                  + apiVersion      = "infrastructure.cluster.x-k8s.io/v1alpha1"
                  + fieldPath       = (known after apply)
                  + kind            = "ProxmoxCluster"
                  + name            = "testing-cluster-proxmox-cluster"
                  + namespace       = (known after apply)
                  + resourceVersion = (known after apply)
                  + uid             = (known after apply)
                }
              + paused               = (known after apply)
              + topology             = {
                  + class          = (known after apply)
                  + classNamespace = (known after apply)
                  + controlPlane   = {
                      + machineHealthCheck      = {
                          + enable              = (known after apply)
                          + maxUnhealthy        = (known after apply)
                          + nodeStartupTimeout  = (known after apply)
                          + remediationTemplate = {
                              + apiVersion      = (known after apply)
                              + fieldPath       = (known after apply)
                              + kind            = (known after apply)
                              + name            = (known after apply)
                              + namespace       = (known after apply)
                              + resourceVersion = (known after apply)
                              + uid             = (known after apply)
                            }
                          + unhealthyConditions = (known after apply)
                          + unhealthyRange      = (known after apply)
                        }
                      + metadata                = {
                          + annotations = (known after apply)
                          + labels      = (known after apply)
                        }
                      + nodeDeletionTimeout     = (known after apply)
                      + nodeDrainTimeout        = (known after apply)
                      + nodeVolumeDetachTimeout = (known after apply)
                      + readinessGates          = (known after apply)
                      + replicas                = (known after apply)
                      + variables               = {
                          + overrides = (known after apply)
                        }
                    }
                  + rolloutAfter   = (known after apply)
                  + variables      = (known after apply)
                  + version        = (known after apply)
                  + workers        = {
                      + machineDeployments = (known after apply)
                      + machinePools       = (known after apply)
                    }
                }
            }
        }

      + wait {
          + condition {
              + status = "True"
              + type   = "Ready"
            }
        }
    }

  # module.proxmox_talos_clusters[0].kubernetes_manifest.cluster_api_manifests["MachineDeployment-testing-cluster-machinedeploy-workers-clusters"] will be created
  + resource "kubernetes_manifest" "cluster_api_manifests" {
      + manifest = {
          + apiVersion = "cluster.x-k8s.io/v1beta1"
          + kind       = "MachineDeployment"
          + metadata   = {
              + name      = "testing-cluster-machinedeploy-workers"
              + namespace = "clusters"
            }
          + spec       = {
              + clusterName = "testing-cluster"
              + replicas    = 2
              + selector    = {
                  + matchLabels = null
                }
              + template    = {
                  + spec = {
                      + bootstrap         = {
                          + configRef = {
                              + apiVersion = "bootstrap.cluster.x-k8s.io/v1alpha3"
                              + kind       = "TalosConfigTemplate"
                              + name       = "testing-cluster-talosconfig-workers"
                            }
                        }
                      + clusterName       = "testing-cluster"
                      + infrastructureRef = {
                          + apiVersion = "infrastructure.cluster.x-k8s.io/v1alpha1"
                          + kind       = "ProxmoxMachineTemplate"
                          + name       = "testing-cluster-worker-template"
                        }
                      + version           = "v1.33.0"
                    }
                }
            }
        }
      + object   = {
          + apiVersion = "cluster.x-k8s.io/v1beta1"
          + kind       = "MachineDeployment"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "testing-cluster-machinedeploy-workers"
              + namespace                  = "clusters"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + clusterName             = "testing-cluster"
              + machineNamingStrategy   = {
                  + template = (known after apply)
                }
              + minReadySeconds         = (known after apply)
              + paused                  = (known after apply)
              + progressDeadlineSeconds = (known after apply)
              + replicas                = 2
              + revisionHistoryLimit    = (known after apply)
              + rolloutAfter            = (known after apply)
              + selector                = {
                  + matchExpressions = (known after apply)
                  + matchLabels      = (known after apply)
                }
              + strategy                = {
                  + remediation   = {
                      + maxInFlight = (known after apply)
                    }
                  + rollingUpdate = {
                      + deletePolicy   = (known after apply)
                      + maxSurge       = (known after apply)
                      + maxUnavailable = (known after apply)
                    }
                  + type          = (known after apply)
                }
              + template                = {
                  + metadata = {
                      + annotations = (known after apply)
                      + labels      = (known after apply)
                    }
                  + spec     = {
                      + bootstrap               = {
                          + configRef      = {
                              + apiVersion      = "bootstrap.cluster.x-k8s.io/v1alpha3"
                              + fieldPath       = (known after apply)
                              + kind            = "TalosConfigTemplate"
                              + name            = "testing-cluster-talosconfig-workers"
                              + namespace       = (known after apply)
                              + resourceVersion = (known after apply)
                              + uid             = (known after apply)
                            }
                          + dataSecretName = (known after apply)
                        }
                      + clusterName             = "testing-cluster"
                      + failureDomain           = (known after apply)
                      + infrastructureRef       = {
                          + apiVersion      = "infrastructure.cluster.x-k8s.io/v1alpha1"
                          + fieldPath       = (known after apply)
                          + kind            = "ProxmoxMachineTemplate"
                          + name            = "testing-cluster-worker-template"
                          + namespace       = (known after apply)
                          + resourceVersion = (known after apply)
                          + uid             = (known after apply)
                        }
                      + nodeDeletionTimeout     = (known after apply)
                      + nodeDrainTimeout        = (known after apply)
                      + nodeVolumeDetachTimeout = (known after apply)
                      + providerID              = (known after apply)
                      + readinessGates          = (known after apply)
                      + version                 = "v1.33.0"
                    }
                }
            }
        }

      + wait {
          + condition {
              + status = "True"
              + type   = "Ready"
            }
        }
    }

  # module.proxmox_talos_clusters[0].kubernetes_manifest.cluster_api_manifests["ProxmoxCluster-testing-cluster-proxmox-cluster-clusters"] will be created
  + resource "kubernetes_manifest" "cluster_api_manifests" {
      + manifest = {
          + apiVersion = "infrastructure.cluster.x-k8s.io/v1alpha1"
          + kind       = "ProxmoxCluster"
          + metadata   = {
              + name      = "testing-cluster-proxmox-cluster"
              + namespace = "clusters"
            }
          + spec       = {
              + allowedNodes         = [
                  + "node03",
                ]
              + controlPlaneEndpoint = {
                  + host = "192.168.1.100"
                  + port = 6443
                }
              + credentialsRef       = {
                  + name = "proxmox-credentials"
                }
              + dnsServers           = [
                  + "192.168.1.3",
                  + "8.8.4.4",
                ]
              + ipv4Config           = {
                  + addresses = [
                      + "192.168.1.101-192.168.1.110",
                    ]
                  + gateway   = "192.168.1.1"
                  + prefix    = 24
                }
              + schedulerHints       = {
                  + memoryAdjustment = 0
                }
            }
        }
      + object   = {
          + apiVersion = "infrastructure.cluster.x-k8s.io/v1alpha1"
          + kind       = "ProxmoxCluster"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "testing-cluster-proxmox-cluster"
              + namespace                  = "clusters"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + allowedNodes                = [
                  + "node03",
                ]
              + cloneSpec                   = {
                  + machineSpec               = (known after apply)
                  + sshAuthorizedKeys         = (known after apply)
                  + virtualIPNetworkInterface = (known after apply)
                }
              + controlPlaneEndpoint        = {
                  + host = "192.168.1.100"
                  + port = 6443
                }
              + credentialsRef              = {
                  + name      = "proxmox-credentials"
                  + namespace = (known after apply)
                }
              + dnsServers                  = [
                  + "192.168.1.3",
                  + "8.8.4.4",
                ]
              + externalManagedControlPlane = (known after apply)
              + ipv4Config                  = {
                  + addresses = [
                      + "192.168.1.101-192.168.1.110",
                    ]
                  + gateway   = "192.168.1.1"
                  + metric    = (known after apply)
                  + prefix    = 24
                }
              + ipv6Config                  = {
                  + addresses = (known after apply)
                  + gateway   = (known after apply)
                  + metric    = (known after apply)
                  + prefix    = (known after apply)
                }
              + schedulerHints              = {
                  + memoryAdjustment = 0
                }
            }
        }

      + wait {
          + condition {
              + status = "True"
              + type   = "Ready"
            }
        }
    }

  # module.proxmox_talos_clusters[0].kubernetes_manifest.cluster_api_manifests["ProxmoxMachineTemplate-testing-cluster-control-plane-template-clusters"] will be created
  + resource "kubernetes_manifest" "cluster_api_manifests" {
      + manifest = {
          + apiVersion = "infrastructure.cluster.x-k8s.io/v1alpha1"
          + kind       = "ProxmoxMachineTemplate"
          + metadata   = {
              + name      = "testing-cluster-control-plane-template"
              + namespace = "clusters"
            }
          + spec       = {
              + template = {
                  + spec = {
                      + checks           = {
                          + skipCloudInitStatus = true
                          + skipQemuGuestAgent  = true
                        }
                      + disks            = {
                          + bootVolume = {
                              + disk   = "scsi0"
                              + sizeGb = 20
                            }
                        }
                      + format           = "qcow2"
                      + full             = true
                      + memoryMiB        = 2048
                      + metadataSettings = {
                          + providerIDInjection = true
                        }
                      + network          = {
                          + default = {
                              + bridge = "vmbr0"
                              + model  = "virtio"
                            }
                        }
                      + numCores         = 2
                      + numSockets       = 1
                      + sourceNode       = "node03"
                      + templateID       = 103
                    }
                }
            }
        }
      + object   = {
          + apiVersion = "infrastructure.cluster.x-k8s.io/v1alpha1"
          + kind       = "ProxmoxMachineTemplate"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "testing-cluster-control-plane-template"
              + namespace                  = "clusters"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + template = {
                  + metadata = {
                      + annotations = (known after apply)
                      + labels      = (known after apply)
                    }
                  + spec     = {
                      + allowedNodes     = (known after apply)
                      + checks           = {
                          + skipCloudInitStatus = true
                          + skipQemuGuestAgent  = true
                        }
                      + description      = (known after apply)
                      + disks            = {
                          + bootVolume = {
                              + disk   = "scsi0"
                              + sizeGb = 20
                            }
                        }
                      + format           = "qcow2"
                      + full             = true
                      + memoryMiB        = 2048
                      + metadataSettings = {
                          + providerIDInjection = true
                        }
                      + network          = {
                          + additionalDevices = (known after apply)
                          + default           = {
                              + bridge      = "vmbr0"
                              + dnsServers  = (known after apply)
                              + ipv4PoolRef = {
                                  + apiGroup = (known after apply)
                                  + kind     = (known after apply)
                                  + name     = (known after apply)
                                }
                              + ipv6PoolRef = {
                                  + apiGroup = (known after apply)
                                  + kind     = (known after apply)
                                  + name     = (known after apply)
                                }
                              + model       = "virtio"
                              + mtu         = (known after apply)
                              + vlan        = (known after apply)
                            }
                          + vrfs              = (known after apply)
                        }
                      + numCores         = 2
                      + numSockets       = 1
                      + pool             = (known after apply)
                      + providerID       = (known after apply)
                      + snapName         = (known after apply)
                      + sourceNode       = "node03"
                      + storage          = (known after apply)
                      + tags             = (known after apply)
                      + target           = (known after apply)
                      + templateID       = 103
                      + templateSelector = {
                          + matchTags = (known after apply)
                        }
                      + virtualMachineID = (known after apply)
                      + vmIDRange        = {
                          + end   = (known after apply)
                          + start = (known after apply)
                        }
                    }
                }
            }
        }
    }

  # module.proxmox_talos_clusters[0].kubernetes_manifest.cluster_api_manifests["ProxmoxMachineTemplate-testing-cluster-worker-template-clusters"] will be created
  + resource "kubernetes_manifest" "cluster_api_manifests" {
      + manifest = {
          + apiVersion = "infrastructure.cluster.x-k8s.io/v1alpha1"
          + kind       = "ProxmoxMachineTemplate"
          + metadata   = {
              + name      = "testing-cluster-worker-template"
              + namespace = "clusters"
            }
          + spec       = {
              + template = {
                  + spec = {
                      + checks           = {
                          + skipCloudInitStatus = true
                          + skipQemuGuestAgent  = true
                        }
                      + disks            = {
                          + bootVolume = {
                              + disk   = "scsi0"
                              + sizeGb = 30
                            }
                        }
                      + format           = "qcow2"
                      + full             = true
                      + memoryMiB        = 4096
                      + metadataSettings = {
                          + providerIDInjection = true
                        }
                      + network          = {
                          + default = {
                              + bridge = "vmbr0"
                              + model  = "virtio"
                            }
                        }
                      + numCores         = 2
                      + numSockets       = 1
                      + sourceNode       = "node03"
                      + templateID       = 103
                    }
                }
            }
        }
      + object   = {
          + apiVersion = "infrastructure.cluster.x-k8s.io/v1alpha1"
          + kind       = "ProxmoxMachineTemplate"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "testing-cluster-worker-template"
              + namespace                  = "clusters"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + template = {
                  + metadata = {
                      + annotations = (known after apply)
                      + labels      = (known after apply)
                    }
                  + spec     = {
                      + allowedNodes     = (known after apply)
                      + checks           = {
                          + skipCloudInitStatus = true
                          + skipQemuGuestAgent  = true
                        }
                      + description      = (known after apply)
                      + disks            = {
                          + bootVolume = {
                              + disk   = "scsi0"
                              + sizeGb = 30
                            }
                        }
                      + format           = "qcow2"
                      + full             = true
                      + memoryMiB        = 4096
                      + metadataSettings = {
                          + providerIDInjection = true
                        }
                      + network          = {
                          + additionalDevices = (known after apply)
                          + default           = {
                              + bridge      = "vmbr0"
                              + dnsServers  = (known after apply)
                              + ipv4PoolRef = {
                                  + apiGroup = (known after apply)
                                  + kind     = (known after apply)
                                  + name     = (known after apply)
                                }
                              + ipv6PoolRef = {
                                  + apiGroup = (known after apply)
                                  + kind     = (known after apply)
                                  + name     = (known after apply)
                                }
                              + model       = "virtio"
                              + mtu         = (known after apply)
                              + vlan        = (known after apply)
                            }
                          + vrfs              = (known after apply)
                        }
                      + numCores         = 2
                      + numSockets       = 1
                      + pool             = (known after apply)
                      + providerID       = (known after apply)
                      + snapName         = (known after apply)
                      + sourceNode       = "node03"
                      + storage          = (known after apply)
                      + tags             = (known after apply)
                      + target           = (known after apply)
                      + templateID       = 103
                      + templateSelector = {
                          + matchTags = (known after apply)
                        }
                      + virtualMachineID = (known after apply)
                      + vmIDRange        = {
                          + end   = (known after apply)
                          + start = (known after apply)
                        }
                    }
                }
            }
        }
    }

  # module.proxmox_talos_clusters[0].kubernetes_manifest.cluster_api_manifests["TalosConfigTemplate-testing-cluster-talosconfig-workers-clusters"] will be created
  + resource "kubernetes_manifest" "cluster_api_manifests" {
      + manifest = {
          + apiVersion = "bootstrap.cluster.x-k8s.io/v1alpha3"
          + kind       = "TalosConfigTemplate"
          + metadata   = {
              + name      = "testing-cluster-talosconfig-workers"
              + namespace = "clusters"
            }
          + spec       = {
              + template = {
                  + spec = {
                      + configPatches = [
                          + {
                              + op    = "replace"
                              + path  = "/machine/install"
                              + value = {
                                  + disk = "/dev/sda"
                                }
                            },
                          + {
                              + op    = "add"
                              + path  = "/machine/kubelet/extraArgs"
                              + value = {
                                  + cloud-provider = "external"
                                }
                            },
                          + {
                              + op    = "add"
                              + path  = "/machine/kubelet/extraArgs/rotate-server-certificates"
                              + value = "true"
                            },
                        ]
                      + generateType  = "worker"
                    }
                }
            }
        }
      + object   = {
          + apiVersion = "bootstrap.cluster.x-k8s.io/v1alpha3"
          + kind       = "TalosConfigTemplate"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "testing-cluster-talosconfig-workers"
              + namespace                  = "clusters"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + template = {
                  + spec = {
                      + configPatches    = [
                          + {
                              + op    = "replace"
                              + path  = "/machine/install"
                              + value = {
                                  + disk = "/dev/sda"
                                }
                            },
                          + {
                              + op    = "add"
                              + path  = "/machine/kubelet/extraArgs"
                              + value = {
                                  + cloud-provider = "external"
                                }
                            },
                          + {
                              + op    = "add"
                              + path  = "/machine/kubelet/extraArgs/rotate-server-certificates"
                              + value = "true"
                            },
                        ]
                      + data             = (known after apply)
                      + generateType     = "worker"
                      + hostname         = {
                          + source = (known after apply)
                        }
                      + strategicPatches = (known after apply)
                      + talosVersion     = (known after apply)
                    }
                }
            }
        }
    }

  # module.proxmox_talos_clusters[0].kubernetes_manifest.cluster_api_manifests["TalosControlPlane-testing-cluster-talos-cp-clusters"] will be created
  + resource "kubernetes_manifest" "cluster_api_manifests" {
      + manifest = {
          + apiVersion = "controlplane.cluster.x-k8s.io/v1alpha3"
          + kind       = "TalosControlPlane"
          + metadata   = {
              + name      = "testing-cluster-talos-cp"
              + namespace = "clusters"
            }
          + spec       = {
              + controlPlaneConfig     = {
                  + controlplane = {
                      + configPatches = [
                          + {
                              + op    = "replace"
                              + path  = "/machine/install"
                              + value = {
                                  + disk       = "/dev/sda"
                                  + extensions = [
                                      + {
                                          + image = "ghcr.io/siderolabs/qemu-guest-agent:10.0.2"
                                        },
                                    ]
                                }
                            },
                          + {
                              + op    = "add"
                              + path  = "/machine/install/extraKernelArgs"
                              + value = [
                                  + "net.ifnames=0",
                                ]
                            },
                          + {
                              + op    = "add"
                              + path  = "/machine/network"
                              + value = {
                                  + interfaces = [
                                      + {
                                          + dhcp      = false
                                          + interface = "eth0"
                                          + vip       = {
                                              + ip = "192.168.1.100"
                                            }
                                        },
                                    ]
                                }
                            },
                          + {
                              + op    = "add"
                              + path  = "/machine/kubelet/extraArgs"
                              + value = {
                                  + cloud-provider = "external"
                                }
                            },
                          + {
                              + op    = "add"
                              + path  = "/cluster/externalCloudProvider"
                              + value = {
                                  + enabled   = true
                                  + manifests = [
                                      + "https://raw.githubusercontent.com/siderolabs/talos-cloud-controller-manager/main/docs/deploy/cloud-controller-manager.yml",
                                      + "https://raw.githubusercontent.com/alex1989hu/kubelet-serving-cert-approver/main/deploy/standalone-install.yaml",
                                    ]
                                }
                            },
                          + {
                              + op    = "add"
                              + path  = "/machine/kubelet/extraArgs/rotate-server-certificates"
                              + value = "true"
                            },
                          + {
                              + op    = "add"
                              + path  = "/machine/features/kubernetesTalosAPIAccess"
                              + value = {
                                  + allowedKubernetesNamespaces = [
                                      + "kube-system",
                                    ]
                                  + allowedRoles                = [
                                      + "os:reader",
                                    ]
                                  + enabled                     = true
                                }
                            },
                          + {
                              + op    = "add"
                              + path  = "/machine/kubelet/extraArgs"
                              + value = {
                                  + cloud-provider = "external"
                                }
                            },
                        ]
                      + generateType  = "controlplane"
                    }
                }
              + infrastructureTemplate = {
                  + apiVersion = "infrastructure.cluster.x-k8s.io/v1alpha1"
                  + kind       = "ProxmoxMachineTemplate"
                  + name       = "testing-cluster-control-plane-template"
                  + namespace  = "clusters"
                }
              + replicas               = 1
              + version                = "v1.33.0"
            }
        }
      + object   = {
          + apiVersion = "controlplane.cluster.x-k8s.io/v1alpha3"
          + kind       = "TalosControlPlane"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "testing-cluster-talos-cp"
              + namespace                  = "clusters"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + controlPlaneConfig     = {
                  + controlplane = {
                      + configPatches    = [
                          + {
                              + op    = "replace"
                              + path  = "/machine/install"
                              + value = {
                                  + disk       = "/dev/sda"
                                  + extensions = [
                                      + {
                                          + image = "ghcr.io/siderolabs/qemu-guest-agent:10.0.2"
                                        },
                                    ]
                                }
                            },
                          + {
                              + op    = "add"
                              + path  = "/machine/install/extraKernelArgs"
                              + value = [
                                  + "net.ifnames=0",
                                ]
                            },
                          + {
                              + op    = "add"
                              + path  = "/machine/network"
                              + value = {
                                  + interfaces = [
                                      + {
                                          + dhcp      = false
                                          + interface = "eth0"
                                          + vip       = {
                                              + ip = "192.168.1.100"
                                            }
                                        },
                                    ]
                                }
                            },
                          + {
                              + op    = "add"
                              + path  = "/machine/kubelet/extraArgs"
                              + value = {
                                  + cloud-provider = "external"
                                }
                            },
                          + {
                              + op    = "add"
                              + path  = "/cluster/externalCloudProvider"
                              + value = {
                                  + enabled   = true
                                  + manifests = [
                                      + "https://raw.githubusercontent.com/siderolabs/talos-cloud-controller-manager/main/docs/deploy/cloud-controller-manager.yml",
                                      + "https://raw.githubusercontent.com/alex1989hu/kubelet-serving-cert-approver/main/deploy/standalone-install.yaml",
                                    ]
                                }
                            },
                          + {
                              + op    = "add"
                              + path  = "/machine/kubelet/extraArgs/rotate-server-certificates"
                              + value = "true"
                            },
                          + {
                              + op    = "add"
                              + path  = "/machine/features/kubernetesTalosAPIAccess"
                              + value = {
                                  + allowedKubernetesNamespaces = [
                                      + "kube-system",
                                    ]
                                  + allowedRoles                = [
                                      + "os:reader",
                                    ]
                                  + enabled                     = true
                                }
                            },
                          + {
                              + op    = "add"
                              + path  = "/machine/kubelet/extraArgs"
                              + value = {
                                  + cloud-provider = "external"
                                }
                            },
                        ]
                      + data             = (known after apply)
                      + generateType     = "controlplane"
                      + hostname         = {
                          + source = (known after apply)
                        }
                      + strategicPatches = (known after apply)
                      + talosVersion     = (known after apply)
                    }
                  + init         = {
                      + configPatches    = (known after apply)
                      + data             = (known after apply)
                      + generateType     = (known after apply)
                      + hostname         = {
                          + source = (known after apply)
                        }
                      + strategicPatches = (known after apply)
                      + talosVersion     = (known after apply)
                    }
                }
              + infrastructureTemplate = {
                  + apiVersion      = "infrastructure.cluster.x-k8s.io/v1alpha1"
                  + fieldPath       = (known after apply)
                  + kind            = "ProxmoxMachineTemplate"
                  + name            = "testing-cluster-control-plane-template"
                  + namespace       = "clusters"
                  + resourceVersion = (known after apply)
                  + uid             = (known after apply)
                }
              + replicas               = 1
              + rolloutStrategy        = {
                  + rollingUpdate = {
                      + maxSurge = (known after apply)
                    }
                  + type          = (known after apply)
                }
              + version                = "v1.33.0"
            }
        }

      + wait {
          + condition {
              + status = "True"
              + type   = "Ready"
            }
        }
    }

  # module.proxmox_talos_clusters[0].kubernetes_secret.proxmox_credentials[0] will be created
  + resource "kubernetes_secret" "proxmox_credentials" {
      + data                           = (sensitive value)
      + id                             = (known after apply)
      + type                           = "Opaque"
      + wait_for_service_account_token = true

      + metadata {
          + generation       = (known after apply)
          + name             = "proxmox-credentials"
          + namespace        = "clusters"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # module.proxmox_talos_clusters[0].module.namespace.kubernetes_namespace.this[0] will be created
  + resource "kubernetes_namespace" "this" {
      + id                               = (known after apply)
      + wait_for_default_service_account = false

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "cluster-secrets"             = "true"
              + "kubernetes.io/metadata.name" = "clusters"
            }
          + name             = "clusters"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

  ```
  
  Plan exit code: 0
  